config.org
#+title: Emacs for Noobs
#+author: Valdigleis (Dk4LL)

* Preparação do ambiente

1. Primeiramente, instale o Emacs no seu ambiente, no Debian isso pode ser feito usando o comando: =sudo apt install emacs-nox emacs-common=   
2. Agora execute os comandos =mkdir ~/.config/emacs= e  =touch ~/.config/emacs/init.el ~/.config/emacs/config.org= para criar os arquivos básicos
3. Cole para o arquivo =~/.config/init= o código:
#+begin_example
(org-babel-load-file
  (expand-file-name "config.org" user-emacs-directory))
#+end_example
4. Instale o zsh para tirar maior proveito desta configuração, a instalação pode ser feita usando o comando =sudo apt install zsh=

* Configurações Básicas

** Desabilitar tela de boas-vindas e ativas o scratch

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
#+end_src

** Configuração básica da interface (UI)

#+begin_src emacs-lisp
  ; Desabilita o menu bar
  (menu-bar-mode -1)
  ; Desabilita a visualização dos espaços em branco no final das linhas
  (setopt show-trailing-whitespace nil)
  ; Melhora efeito visual do texto sublinhado
  (setopt x-underline-at-descent-line nil)
  ; Habilita o destaque da linha atual do cursor
  (global-hl-line-mode t)
  ; Define a cor usada para o destaque da linha
  (set-face-background 'hl-line "#5e4a46")
  (set-face-foreground 'highlight nil)
  ; Habilita os indicadores visuais na margem esquerda da janela de edição
  (setopt indicate-buffer-boundaries 'left) 
#+end_src

** Configuração para exibição das linhas
#+begin_src emacs-lisp
  ; Habilita a exibição do número das linhas
  (global-display-line-numbers-mode 1)
  ; Customizar o formato ('relative, 'visual ou 't para absoluto) dos números de linhas
  (setq display-line-numbers-type 'relative)
  ; Desabilitar números de linha para modos específicos
  (dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
		eshell-mode-hook
		help-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Configuração básica de comportamento

#+begin_src emacs-lisp
  ; Desativar backups globalmente
  (setq make-backup-files nil)
  ; Habilita o salvamento da posição do cursor ao sair
  (save-place-mode 1)
  ; Habilita a funcionalidade de lembrar de arquivos recentes
  (recentf-mode 1)
  ; Habilita o salvamento do historico de comandos
  (savehist-mode 1)
  ; Habilita a atualização automática para os buffers dos arquivos modificados externamente
  (setopt auto-revert-avoid-polling t)
  ; Define o intervalo em segundos que o Emacs irá verificar se houve atualização externa dos arquivos
  (setopt auto-revert-interval 60)
  ; Habilita o Emacs para verificar informações de controle de versão automaticamente
  (setopt auto-revert-check-vc-info t)
  ; Habilita a movimentação entre janelas usando da combinação C-teclas direcionais
  (windmove-default-keybindings 'control)
  ; Desabilita a necessidade das sentenças terem que terminar com dois espaços
  (setopt sentence-end-double-space nil)
#+end_src


